# missing data

In [4]:
import numpy as np 
import pandas as pd

In [10]:
d ={'A':[1,2,np.nan],'B':[3,np.nan,np.nan],'C':[1,2,3]}

In [11]:
df= pd.DataFrame(d)

In [12]:
df

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.dropna(axis=1)
#axis drop any columns that have null value

   C
0  1
1  2
2  3

In [15]:
df.dropna()
#drop any row with any single/ one or more null or missing values

     A    B  C
0  1.0  3.0  1

In [16]:
df.dropna(thresh=2)
#thresh in example thresh=2 it will return at least two non na values

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2

In [20]:
df

     A    B  C
0  1.0  3.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [21]:
df.fillna(value='value')
#iw we want to fill or replace missing values we can use fillna method

       A      B  C
0    1.0    3.0  1
1    2.0  value  2
2  value  value  3

In [22]:
df['A'].fillna(value=df['A'].max())

0    1.0
1    2.0
2    2.0
Name: A, dtype: float64

In [23]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [25]:
df['B'].fillna(value=df['B'].min())

0    3.0
1    3.0
2    3.0
Name: B, dtype: float64